# 01. Analysis Seoul CCTV

In [62]:
import pandas as pd

## CCTV 데이터 읽기

In [63]:
#데이터 읽기
CCTV_Seoul = pd.read_csv("../data/01. Seoul_CCTV.csv", encoding = "cp949")
CCTV_Seoul.head()
#read_csv 했을 때 UnicodeDecodeError: 'utf-8' codec can't decode byte 0xc0 in position 0: invalid start byte
#와 같은 에러가 떴음
#https://jonhyuk0922.tistory.com/232
#위 사이트를 보고 'cp949'로 인코딩했을때 문제 없이 테이블을 볼 수 있었음.

,구분,총계,2013년 이전 설치된 CCTV,2013년,2014년,2015년,2016년,2017년,2018년,2019년,2020년,2021년,2022년
0,계,"91,341","2,804","3,097","3,981","6,576","8,850","11,566","11,024","13,151","11,912","9,144","9,236"
1,종로구,"1,980",36,540,107,161,131,158,152,69,250,85,291
2,중 구,"2,584",130,87,77,236,240,372,386,155,361,403,137
3,용산구,"2,847",44,50,68,83,295,491,115,322,623,422,334
4,성동구,"4,047",58,99,110,366,279,945,459,647,485,367,232

In [64]:
#데이터 컬럼명 보기
CCTV_Seoul.columns

Index(['구분', '총계', '2013년 이전 설치된 CCTV', '2013년', '2014년', '2015년', '2016년',
       '2017년', '2018년', '2019년', '2020년', '2021년', '2022년'],
      dtype='object')

In [65]:
#컬럼명 선택
CCTV_Seoul.columns[0]

'구분'

In [66]:
#컬렴명 변경 
#데이터프레임명.rename(columns = {변경할 컬럼명 : "변경 내용"), inplace = True)
#inplace = True 옵션을 해줘야 원본 데이터프레임에 변경이 적용됨.

CCTV_Seoul.rename(columns = {CCTV_Seoul.columns[0] : "구별"}, inplace = True)
CCTV_Seoul.head()

,구별,총계,2013년 이전 설치된 CCTV,2013년,2014년,2015년,2016년,2017년,2018년,2019년,2020년,2021년,2022년
0,계,"91,341","2,804","3,097","3,981","6,576","8,850","11,566","11,024","13,151","11,912","9,144","9,236"
1,종로구,"1,980",36,540,107,161,131,158,152,69,250,85,291
2,중 구,"2,584",130,87,77,236,240,372,386,155,361,403,137
3,용산구,"2,847",44,50,68,83,295,491,115,322,623,422,334
4,성동구,"4,047",58,99,110,366,279,945,459,647,485,367,232

## 인구수 데이터 읽기

In [17]:
pop_Seoul = pd.read_excel("../data/01. Seoul_Population.xlsx")
pop_Seoul.head()

C:\Users\nabi4\anaconda3\lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

,동별(1),동별(2),2023 1/4,2023 1/4.1,2023 1/4.2,2023 1/4.3,2023 1/4.4,2023 1/4.5,2023 2/4,2023 2/4.1,2023 2/4.2,2023 2/4.3,2023 2/4.4
0,동별(1),동별(2),세대 (세대),계 (명),한국인 (명),등록외국인 (명),세대당인구 (명),65세이상고령자 (명),세대 (세대),계 (명),한국인 (명),등록외국인 (명),인구밀도
1,합계,소계,4463385,9668008,9426404,241604,2.11,1690961,4469158,9659322,9414093,245229,2
2,NaN,종로구,72679,152212,141060,11152,1.94,28265,72507,151349,140397,10952,2
3,NaN,중구,63862,131390,120963,10427,1.89,25353,64375,132054,121441,10613,2
4,NaN,용산구,109735,232482,217756,14726,1.98,39478,109679,232069,217288,14781,2

In [18]:
#데이터프레임이 지저분함.
#원본 파일을 열어서 확인한 후 내가 원하는대로 데이터 추출해주기
#자치구명, 인구수 합계, 한국인 인구수 합계, 등록 외국인 인구수 합계, 65세 이상 고령자 수

In [19]:
pop_Seoul = pd.read_excel(
    "../data/01. Seoul_Population.xlsx", header = 1, usecols = "B,D,E,F,H"
)
pop_Seoul.head()

C:\Users\nabi4\anaconda3\lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

  동별(2)    계 (명)  한국인 (명)  등록외국인 (명)  65세이상고령자 (명)
0    소계  9668008  9426404     241604       1690961
1   종로구   152212   141060      11152         28265
2    중구   131390   120963      10427         25353
3   용산구   232482   217756      14726         39478
4   성동구   287240   280240       7000         48238

In [20]:
# 컬럼명 변경
pop_Seoul.rename(
    columns = {
        pop_Seoul.columns[0] : "구별",
        pop_Seoul.columns[1] : "인구수",
        pop_Seoul.columns[2] : "한국인",
        pop_Seoul.columns[3] : "외국인",
        pop_Seoul.columns[4] : "고령자"
    },
    inplace = True
)
pop_Seoul.head()

    구별      인구수      한국인     외국인      고령자
0   소계  9668008  9426404  241604  1690961
1  종로구   152212   141060   11152    28265
2   중구   131390   120963   10427    25353
3  용산구   232482   217756   14726    39478
4  성동구   287240   280240    7000    48238

## Pandas 기초
- Python에서 R 만큼의 강력한 데이터 핸들링 성능을 제공하는 모듈
- 단일 프로세스에서는 최대 효율
- 코딩 가능하고 응용 가능한 엑셀로 받아들여도 됨
- 누군가 스테로이드를 맞은 엑셀로 표현함

#### Series
- index와 value 로 이루어져 있음
- 한가지 데이터 타입만 가질 수 있음

In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.Series([1,2,3,4]) #데이터를 직접 만들 수 있음

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
pd.Series([1,2,3,4], dtype = np.float64) #데이터형을 정할 수도 있음(자세한 내용은 공식문서 참고)

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [5]:
pd.Series([1,2,3,4, "5"])

0    1
1    2
2    3
3    4
4    5
dtype: object

#### 날짜 데이터

In [10]:
date = pd.date_range("2023-07-28", periods = 6) #원하는 기간 만큼의 날짜 생성 가능

### DataFrame
- pd.Series()
    - index, value
- pd.DataFrame()
    - index, value, column

In [8]:
#표준 정규분포에서 샘플링한 난수 생성
data = np.random.rand(6,4)
data

array([[0.82038986, 0.10821252, 0.32670412, 0.59584036],
       [0.80083311, 0.38967447, 0.42219916, 0.15376446],
       [0.2491869 , 0.5003393 , 0.49432008, 0.00770721],
       [0.86834178, 0.35810617, 0.67830007, 0.73768428],
       [0.00510063, 0.20460398, 0.88545834, 0.84299775],
       [0.1583514 , 0.54609675, 0.57937783, 0.96502905]])

In [12]:
df = pd.DataFrame(data, index = date, columns = ["A", "B", "C", "D"])
df

                   A         B         C         D
2023-07-28  0.820390  0.108213  0.326704  0.595840
2023-07-29  0.800833  0.389674  0.422199  0.153764
2023-07-30  0.249187  0.500339  0.494320  0.007707
2023-07-31  0.868342  0.358106  0.678300  0.737684
2023-08-01  0.005101  0.204604  0.885458  0.842998
2023-08-02  0.158351  0.546097  0.579378  0.965029

### 데이터프레임 정보 탐색

In [13]:
df.head()

                   A         B         C         D
2023-07-28  0.820390  0.108213  0.326704  0.595840
2023-07-29  0.800833  0.389674  0.422199  0.153764
2023-07-30  0.249187  0.500339  0.494320  0.007707
2023-07-31  0.868342  0.358106  0.678300  0.737684
2023-08-01  0.005101  0.204604  0.885458  0.842998

#### 데이터 인덱스, 컬럼명, 값 확인

In [14]:
df.index

DatetimeIndex(['2023-07-28', '2023-07-29', '2023-07-30', '2023-07-31',
               '2023-08-01', '2023-08-02'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.values

array([[0.82038986, 0.10821252, 0.32670412, 0.59584036],
       [0.80083311, 0.38967447, 0.42219916, 0.15376446],
       [0.2491869 , 0.5003393 , 0.49432008, 0.00770721],
       [0.86834178, 0.35810617, 0.67830007, 0.73768428],
       [0.00510063, 0.20460398, 0.88545834, 0.84299775],
       [0.1583514 , 0.54609675, 0.57937783, 0.96502905]])

In [17]:
df.info() #데이터 프레임 정보 확인

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2023-07-28 to 2023-08-02
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [18]:
df.describe() #데이터 프레임 기술통계 정보 확인

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.483701  0.351172  0.564393  0.550504
std    0.387760  0.168694  0.198951  0.386395
min    0.005101  0.108213  0.326704  0.007707
25%    0.181060  0.242980  0.440229  0.264283
50%    0.525010  0.373890  0.536849  0.666762
75%    0.815501  0.472673  0.653570  0.816669
max    0.868342  0.546097  0.885458  0.965029

#### 데이터 정렬

In [20]:
df.sort_values(by = "B")#특정 컬럼을 기준으로 데이터 정렬
#ascending = False 내림차순 정렬
#inplace = True 원본 데이터에 저장

                   A         B         C         D
2023-07-28  0.820390  0.108213  0.326704  0.595840
2023-08-01  0.005101  0.204604  0.885458  0.842998
2023-07-31  0.868342  0.358106  0.678300  0.737684
2023-07-29  0.800833  0.389674  0.422199  0.153764
2023-07-30  0.249187  0.500339  0.494320  0.007707
2023-08-02  0.158351  0.546097  0.579378  0.965029

#### 데이터 선택

In [22]:
#한 개 컬럼 선택
df['A'] #컬럼명이 문자열인 경우 df.A 로도 선택 가능

2023-07-28    0.820390
2023-07-29    0.800833
2023-07-30    0.249187
2023-07-31    0.868342
2023-08-01    0.005101
2023-08-02    0.158351
Freq: D, Name: A, dtype: float64

In [23]:
type(df["A"])

pandas.core.series.Series

In [24]:
#두 개 이상 컬럼 선택
df[["A", "B"]]

                   A         B
2023-07-28  0.820390  0.108213
2023-07-29  0.800833  0.389674
2023-07-30  0.249187  0.500339
2023-07-31  0.868342  0.358106
2023-08-01  0.005101  0.204604
2023-08-02  0.158351  0.546097

### offset index
- [n:m] : n부터 m-1까지
- 인덱스나 컬럼명으로 slice하는 경우는 끝까지 포함

In [25]:
df

                   A         B         C         D
2023-07-28  0.820390  0.108213  0.326704  0.595840
2023-07-29  0.800833  0.389674  0.422199  0.153764
2023-07-30  0.249187  0.500339  0.494320  0.007707
2023-07-31  0.868342  0.358106  0.678300  0.737684
2023-08-01  0.005101  0.204604  0.885458  0.842998
2023-08-02  0.158351  0.546097  0.579378  0.965029

In [26]:
df[0:3]

                   A         B         C         D
2023-07-28  0.820390  0.108213  0.326704  0.595840
2023-07-29  0.800833  0.389674  0.422199  0.153764
2023-07-30  0.249187  0.500339  0.494320  0.007707

In [28]:
df["2023-07-28":"2023-07-31"]

                   A         B         C         D
2023-07-28  0.820390  0.108213  0.326704  0.595840
2023-07-29  0.800833  0.389674  0.422199  0.153764
2023-07-30  0.249187  0.500339  0.494320  0.007707
2023-07-31  0.868342  0.358106  0.678300  0.737684

- loc : location
- index 이름으로 특정 행, 열 선택

In [29]:
df.loc[:, ["A" , "B"]] #행, 열

                   A         B
2023-07-28  0.820390  0.108213
2023-07-29  0.800833  0.389674
2023-07-30  0.249187  0.500339
2023-07-31  0.868342  0.358106
2023-08-01  0.005101  0.204604
2023-08-02  0.158351  0.546097

In [31]:
df.loc["2023-07-28":"2023-07-31", ["A", "C"]]

                   A         C
2023-07-28  0.820390  0.326704
2023-07-29  0.800833  0.422199
2023-07-30  0.249187  0.494320
2023-07-31  0.868342  0.678300

In [32]:
df.loc["2023-07-28":"2023-07-31", "A":"C"]

                   A         B         C
2023-07-28  0.820390  0.108213  0.326704
2023-07-29  0.800833  0.389674  0.422199
2023-07-30  0.249187  0.500339  0.494320
2023-07-31  0.868342  0.358106  0.678300

- iloc : integer location
    - 컴퓨터가 인식하는 인덱스 값으로 선택

In [34]:
df

                   A         B         C         D
2023-07-28  0.820390  0.108213  0.326704  0.595840
2023-07-29  0.800833  0.389674  0.422199  0.153764
2023-07-30  0.249187  0.500339  0.494320  0.007707
2023-07-31  0.868342  0.358106  0.678300  0.737684
2023-08-01  0.005101  0.204604  0.885458  0.842998
2023-08-02  0.158351  0.546097  0.579378  0.965029

In [35]:
df.iloc[3] #행

A    0.868342
B    0.358106
C    0.678300
D    0.737684
Name: 2023-07-31 00:00:00, dtype: float64

In [36]:
df.iloc[3,2] #행, 열

0.6783000671937987

In [37]:
df.iloc[3:5, 0:2]

                   A         B
2023-07-31  0.868342  0.358106
2023-08-01  0.005101  0.204604

### condition

In [38]:
df

                   A         B         C         D
2023-07-28  0.820390  0.108213  0.326704  0.595840
2023-07-29  0.800833  0.389674  0.422199  0.153764
2023-07-30  0.249187  0.500339  0.494320  0.007707
2023-07-31  0.868342  0.358106  0.678300  0.737684
2023-08-01  0.005101  0.204604  0.885458  0.842998
2023-08-02  0.158351  0.546097  0.579378  0.965029

In [40]:
# A 컬럼에서 양수만 선택
df["A"] > 0

2023-07-28    True
2023-07-29    True
2023-07-30    True
2023-07-31    True
2023-08-01    True
2023-08-02    True
Freq: D, Name: A, dtype: bool

In [41]:
df[df["A"] > 0]

                   A         B         C         D
2023-07-28  0.820390  0.108213  0.326704  0.595840
2023-07-29  0.800833  0.389674  0.422199  0.153764
2023-07-30  0.249187  0.500339  0.494320  0.007707
2023-07-31  0.868342  0.358106  0.678300  0.737684
2023-08-01  0.005101  0.204604  0.885458  0.842998
2023-08-02  0.158351  0.546097  0.579378  0.965029

#### 컬럼 추가
- 기존 컬럼이 있으면 변경, 없으면 추가하는 방식

In [42]:
df

                   A         B         C         D
2023-07-28  0.820390  0.108213  0.326704  0.595840
2023-07-29  0.800833  0.389674  0.422199  0.153764
2023-07-30  0.249187  0.500339  0.494320  0.007707
2023-07-31  0.868342  0.358106  0.678300  0.737684
2023-08-01  0.005101  0.204604  0.885458  0.842998
2023-08-02  0.158351  0.546097  0.579378  0.965029

In [44]:
df["E"] = ["one", "two", "three", "four", "five", "six"]
df

                   A         B         C         D      E
2023-07-28  0.820390  0.108213  0.326704  0.595840    one
2023-07-29  0.800833  0.389674  0.422199  0.153764    two
2023-07-30  0.249187  0.500339  0.494320  0.007707  three
2023-07-31  0.868342  0.358106  0.678300  0.737684   four
2023-08-01  0.005101  0.204604  0.885458  0.842998   five
2023-08-02  0.158351  0.546097  0.579378  0.965029    six

- isin()
    특정 요소가 있는지 확인

In [45]:
df["E"] .isin(["two", "four"])

2023-07-28    False
2023-07-29     True
2023-07-30    False
2023-07-31     True
2023-08-01    False
2023-08-02    False
Freq: D, Name: E, dtype: bool

In [46]:
df[df["E"] .isin(["two", "four"])] #특정 조건에 맞는 행만 추출

                   A         B         C         D     E
2023-07-29  0.800833  0.389674  0.422199  0.153764   two
2023-07-31  0.868342  0.358106  0.678300  0.737684  four

#### 특정 컬럼 제거
- del
- drop

In [47]:
df

                   A         B         C         D      E
2023-07-28  0.820390  0.108213  0.326704  0.595840    one
2023-07-29  0.800833  0.389674  0.422199  0.153764    two
2023-07-30  0.249187  0.500339  0.494320  0.007707  three
2023-07-31  0.868342  0.358106  0.678300  0.737684   four
2023-08-01  0.005101  0.204604  0.885458  0.842998   five
2023-08-02  0.158351  0.546097  0.579378  0.965029    six

In [48]:
del df["E"] #원본 데이터까지 삭제해버림
df

                   A         B         C         D
2023-07-28  0.820390  0.108213  0.326704  0.595840
2023-07-29  0.800833  0.389674  0.422199  0.153764
2023-07-30  0.249187  0.500339  0.494320  0.007707
2023-07-31  0.868342  0.358106  0.678300  0.737684
2023-08-01  0.005101  0.204604  0.885458  0.842998
2023-08-02  0.158351  0.546097  0.579378  0.965029

In [49]:
#그에 반해, drop은 원본 데이터까지 삭제하진 않음
df.drop(["D"], axis = 1) #axis = 0 가로, axis = 1세로

                   A         B         C
2023-07-28  0.820390  0.108213  0.326704
2023-07-29  0.800833  0.389674  0.422199
2023-07-30  0.249187  0.500339  0.494320
2023-07-31  0.868342  0.358106  0.678300
2023-08-01  0.005101  0.204604  0.885458
2023-08-02  0.158351  0.546097  0.579378

In [50]:
df.drop(["2023-08-02"])

                   A         B         C         D
2023-07-28  0.820390  0.108213  0.326704  0.595840
2023-07-29  0.800833  0.389674  0.422199  0.153764
2023-07-30  0.249187  0.500339  0.494320  0.007707
2023-07-31  0.868342  0.358106  0.678300  0.737684
2023-08-01  0.005101  0.204604  0.885458  0.842998

#### apply()
괄호 안에 들어가는 함수를 데이터프레임에 적용시켜줌

In [51]:
df

                   A         B         C         D
2023-07-28  0.820390  0.108213  0.326704  0.595840
2023-07-29  0.800833  0.389674  0.422199  0.153764
2023-07-30  0.249187  0.500339  0.494320  0.007707
2023-07-31  0.868342  0.358106  0.678300  0.737684
2023-08-01  0.005101  0.204604  0.885458  0.842998
2023-08-02  0.158351  0.546097  0.579378  0.965029

In [52]:
df["A"].apply("sum")

2.9022036790503596

In [54]:
df["A"].apply("min") , df["A"].apply('max')

(0.005100631162870517, 0.8683417812764914)

In [55]:
df[["A", "D"]].apply("sum")

A    2.902204
D    3.303023
dtype: float64

In [56]:
df["A"].apply(np.sum)

2023-07-28    0.820390
2023-07-29    0.800833
2023-07-30    0.249187
2023-07-31    0.868342
2023-08-01    0.005101
2023-08-02    0.158351
Freq: D, Name: A, dtype: float64

In [57]:
def plusminus(num): #사용자 함수를 집어넣어 데이터프레임을 변환시킬 수도 있음
    return "plus" if num > 0 else "minus"

In [58]:
df["A"].apply(plusminus)

2023-07-28    plus
2023-07-29    plus
2023-07-30    plus
2023-07-31    plus
2023-08-01    plus
2023-08-02    plus
Freq: D, Name: A, dtype: object

In [59]:
df["A"].apply(lambda num : "plus" if num > 0 else "minus" )

2023-07-28    plus
2023-07-29    plus
2023-07-30    plus
2023-07-31    plus
2023-08-01    plus
2023-08-02    plus
Freq: D, Name: A, dtype: object

### CCTV 데이터 훑어보기

In [67]:
CCTV_Seoul.head()

,구별,총계,2013년 이전 설치된 CCTV,2013년,2014년,2015년,2016년,2017년,2018년,2019년,2020년,2021년,2022년
0,계,"91,341","2,804","3,097","3,981","6,576","8,850","11,566","11,024","13,151","11,912","9,144","9,236"
1,종로구,"1,980",36,540,107,161,131,158,152,69,250,85,291
2,중 구,"2,584",130,87,77,236,240,372,386,155,361,403,137
3,용산구,"2,847",44,50,68,83,295,491,115,322,623,422,334
4,성동구,"4,047",58,99,110,366,279,945,459,647,485,367,232

In [69]:
#'계' 행 삭제
CCTV_Seoul = CCTV_Seoul.drop([0], axis = 0)
CCTV_Seoul.head()

,구별,총계,2013년 이전 설치된 CCTV,2013년,2014년,2015년,2016년,2017년,2018년,2019년,2020년,2021년,2022년
1,종로구,"1,980",36,540,107,161,131,158,152,69,250,85,291
2,중 구,"2,584",130,87,77,236,240,372,386,155,361,403,137
3,용산구,"2,847",44,50,68,83,295,491,115,322,623,422,334
4,성동구,"4,047",58,99,110,366,279,945,459,647,485,367,232
5,광진구,"3,480",507,82,84,64,21,465,443,709,172,662,271

In [70]:
#CCTV를 가장 적게 보유한 구 3개
CCTV_Seoul.sort_values(by= "총계", ascending = True).head(3)

,구별,총계,2013년 이전 설치된 CCTV,2013년,2014년,2015년,2016년,2017년,2018년,2019년,2020년,2021년,2022년
1,종로구,"1,980",36,540,107,161,131,158,152,69,250,85,291
10,도봉구,"2,247",103,2,79,72,103,117,200,202,183,600,586
2,중 구,"2,584",130,87,77,236,240,372,386,155,361,403,137

In [74]:
CCTV_Seoul.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 1 to 25
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   구별                 25 non-null     object
 1   총계                 25 non-null     object
 2   2013년 이전 설치된 CCTV  25 non-null     object
 3   2013년              25 non-null     object
 4   2014년              25 non-null     object
 5   2015년              25 non-null     object
 6   2016년              25 non-null     object
 7   2017년              25 non-null     object
 8   2018년              25 non-null     object
 9   2019년              25 non-null     object
 10  2020년              25 non-null     object
 11  2021년              25 non-null     object
 12  2022년              25 non-null     object
dtypes: object(13)
memory usage: 2.7+ KB